changed ascii charts to mermaid graph
